{ "posts": [
      
      
      {
      "title": "Introducing Mac Tíre",
      "date": "01/04/2016",
      "body": "Unmute Records are pleased to announce that they are now working with Mac Tíre. Mac Tíre is a 22 year-old singer/songwriter from Bangor, Northern Ireland. Mac Tíre’s main influences are The Paper Kites, Ben Howard, Tom Odell, The Kooks & Cage the Elephant. Mac Tíre has been honing his art since 2013 and releasing it through social media platforms. The team at Unmute Records and Mac Tíre are enthusiastic and excited to bring him and his songs, to a wider audience through interviews, recordings, radio spots and live performances. Please enjoy this <a href='https://www.youtube.com/watch?v=NTT3tjE0cpA'>live session</a> showcasing a few of his original songs. We cannot wait to bring you all more updates and content involving Mac Tíre!"
      },
    
      {
      "title": "The Best Thing Photoshoot",
      "date": "28/04/2016",
      "body": "Unmute Records and Mac Tire recently met up and took some pictures leading up to the launch of his new single, “The Best Thing”.  More pictures and media content coming very soon! \nCheck out the pictures on the <a href='https://www.facebook.com/Unmute-Records-801511559954270/photos_stream?tab=photos_stream'>Unmute Records Facebook Page</a>."
      },
      
      {
      "title": "Unmute Records Interviews Mac Tíre",
      "date": "29/04/2016",
      "body": "Learn more about Unmute Record's new talented artist Mac Tíre in this new <a href='https://www.youtube.com/watch?v=FHu6id0ApZE'>video interview</a>, filmed in the Belfast Metropolitan College studio! A Full transcription of the interview can also be found below: \n\n\n<b>Tell us more about yourself…</b> \n“I'm a town boy from Bangor. My family took me camping since I was about 3 so I'm a very outdoorsy person. I like going hiking in the woods and I love wolves. That's where I got my stage name ‘Mac Tire’, as its Irish for wolf. The literal translation is ‘son of the land’ but I thought it was really cool because the Irish used to call wolves ‘sons of the land’.\n\n<b>What instruments do you play?</b>\nI play the guitar mostly..kind of..I tried to play drums sometimes but my brother always said ‘stop trying, Ross. You just don't have that rhythm.’ I only have rhythm in one hand and the other hand just doesn't know what to do, so really just the guitar. I've been playing guitar since I was 15. It's a funny story how I actually started playing. There was this girls Emma and she said she was getting a guitar for her birthday and I just thought I could totally learn guitar and teach her. So I started learning guitar for a few months, learnt a few chords and was like “Emma I could totally teach you guitar.”\n\n<b>Describe your playing style..</b>\nVery very basic almost more of a songwriter than I am a guitarist. It's sort of an instrument more for me to try and write songs to. I try to do a bit more finger style but mostly just rhythm.\n\n<b>Any musical influences?</b>\n I can't stop listening to ‘The Paper Kites’ and ‘Ben Howard’. When I was growing up it was all punk rock and 90’s sort of stuff like ‘sum 41’ and ‘Blink182’ and all that sort of stuff. I really liked indie stuff for a while. ‘The Kooks’ and ‘Cage the Elephant’ and stuff like that. It was funny, every time a write a song, it depends what I'm listening to at the time. The songs kind of sound like that genre a wee bit.\n\n<b>Have you released any music online? </b>\nYeah, I've done a few things. I first started in YouTube when I first started playing when I was 17 and it's terrible. I tried to talk at the start of each one and just sounded like an absolute idiot. Then I did soundcloud for a bit and it was ok but was annoying having to share the soundcloud onto Facebook and stuff as no one really saw me in stuff like that. Then I'm back to just putting videos on my Facebook page.\n\n<b>Are you excited to work with Unmute records?</b>\nI gigged for a bit just once or twice a year then there was a year I did open mic nights all the time but I'm really hoping to get back into that and sort of try and get some exposure. I have a lot of tracks but it's holding down on the ones that actually have potential and that will hopefully affect other people in a good way."
      }
    

  ]

}